# Task 4.9 Part 1: Incorporating Customer Data Set

## Content of Workbook:
## Step 3: Import Libraries
## Step 4: Data Wrangling
## Step 5: Data Consistency Checks
## Step 6: Combining customer data with rest of prepared data
## Step 8: Export new dataframe

### Step 3: Import Libraries

In [23]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [24]:
# Import customer data set
path = r'C:\Users\daxma\OneDrive\Desktop\Data Analytics\Data Immersion\Achievement 4\01-2025 Instacart Basket Analysis'
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [25]:
# Check output
df_cust.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [26]:
# Check number of rows
df_cust.shape

(206209, 10)

### Step 4: Data Wrangling

In [28]:
# Rename columns for consistency
df_cust.rename(columns={
    'First Name': 'first_name',
    'Surnam': 'last_name',
    'Gender': 'gender',
    'STATE': 'state',
    'Age': 'age',
    'date_joined': 'date_joined',
    'n_dependants': 'num_dependents',
    'fam_status': 'family_status',
    'income': 'annual_income'
}, inplace=True)

In [29]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_dependents,family_status,annual_income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [30]:
# Convert `date_joined` to `years_as_customer`
df_cust['date_joined'] = pd.to_datetime(df_cust['date_joined'], errors='coerce')  # Convert to datetime

In [31]:
# Import datetime module
from datetime import datetime

# Get current year
current_year = datetime.today().year

In [32]:
# Calculate years
df_cust['years_as_customer'] = current_year - df_cust['date_joined'].dt.year

In [33]:
# Check output
(df_cust[['user_id', 'date_joined', 'years_as_customer']].head())

   user_id date_joined  years_as_customer
0    26711  2017-01-01                  8
1    33890  2017-01-01                  8
2    65803  2017-01-01                  8
3   125935  2017-01-01                  8
4   130797  2017-01-01                  8

In [34]:
# Check consistency of column outputs
df_cust['gender'].value_counts()

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [35]:
# Check consistency of column outputs
df_cust['state'].value_counts()

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [36]:
# Check consistency of column outputs
df_cust['family_status'].value_counts()

family_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [37]:
# Check data types
print(df_cust.dtypes)

user_id                       int64
first_name                   object
last_name                    object
gender                       object
state                        object
age                           int64
date_joined          datetime64[ns]
num_dependents                int64
family_status                object
annual_income                 int64
years_as_customer             int32
dtype: object

In [38]:
# Convert text columns to string
df_cust['first_name'] = df_cust['first_name'].astype('string')
df_cust['last_name'] = df_cust['last_name'].astype('string')

# Convert categorical columns to category
df_cust['gender'] = df_cust['gender'].astype('category')
df_cust['state'] = df_cust['state'].astype('category')
df_cust['family_status'] = df_cust['family_status'].astype('category')

In [39]:
# Verify changes
print(df_cust.dtypes)

user_id                       int64
first_name           string[python]
last_name            string[python]
gender                     category
state                      category
age                           int64
date_joined          datetime64[ns]
num_dependents                int64
family_status              category
annual_income                 int64
years_as_customer             int32
dtype: object

### Step 5: Data Consistency Checks

In [41]:
# Check for missing values
df_cust.isnull().sum()

user_id                  0
first_name           11259
last_name                0
gender                   0
state                    0
age                      0
date_joined              0
num_dependents           0
family_status            0
annual_income            0
years_as_customer        0
dtype: int64

In [42]:
# Replace missing values in first_name with 'Unknown'
df_cust['first_name'].fillna('Unknown', inplace=True)

C:\Users\daxma\AppData\Local\Temp\ipykernel_3456\3426051632.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_cust['first_name'].fillna('Unknown', inplace=True)

In [43]:
# Verify changes
df_cust.isnull().sum()

user_id              0
first_name           0
last_name            0
gender               0
state                0
age                  0
date_joined          0
num_dependents       0
family_status        0
annual_income        0
years_as_customer    0
dtype: int64

In [44]:
# Check for full duplicate rows
df_dups = df_cust[df_cust.duplicated()]

In [45]:
# Check output
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, num_dependents, family_status, annual_income, years_as_customer]
Index: []

#### No duplicate rows found

In [47]:
# Check for mixed-type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].map(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [72]:
# Check number of rows
df_cust.shape

(206209, 11)

#### No mixed-type columns found

### Step 6: Combining customer data with rest of prepared data

In [192]:
# Import up to date orders and products dataframe
file_path = os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_new_cols.pkl')
ords_prods_merge = pd.read_pickle(file_path)

In [193]:
# Check output
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order_flag,product_id,add_to_cart_order,reordered,...,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_product_price,product_spending_flag,avg_order_spending,order_spending_flag,median_days_since_prior_order,order_freq_flag
0,2539329,1,1,2,8,NaN,1,196,1,0,...,Regularly busy,Average orders,10,New customer,6.367797,Low product spender,37.57,Low order spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,1,14084,2,0,...,Regularly busy,Average orders,10,New customer,6.367797,Low product spender,37.57,Low order spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,1,12427,3,0,...,Regularly busy,Average orders,10,New customer,6.367797,Low product spender,37.57,Low order spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,1,26088,4,0,...,Regularly busy,Average orders,10,New customer,6.367797,Low product spender,37.57,Low order spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,1,26405,5,0,...,Regularly busy,Average orders,10,New customer,6.367797,Low product spender,37.57,Low order spender,20.5,Non-frequent customer

In [194]:
# Check user_id dtype in ords_prods_merge
ords_prods_merge['user_id'].dtype

dtype('int64')

In [224]:
# Merge customer dataframe with ords_prods dataframe
df_ords_prods_cust_merged = df_cust.merge(ords_prods_merge, on = 'user_id')

In [226]:
# Check output
df_ords_prods_cust_merged.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_dependents,family_status,annual_income,...,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_product_price,product_spending_flag,avg_order_spending,order_spending_flag,median_days_since_prior_order,order_freq_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,Average orders,8,New customer,7.988889,Low product spender,17.975,Low order spender,19.0,Regular customer
1,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,Average orders,8,New customer,7.988889,Low product spender,17.975,Low order spender,19.0,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Slowest days,Most orders,8,New customer,7.988889,Low product spender,17.975,Low order spender,19.0,Regular customer
3,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Slowest days,Most orders,8,New customer,7.988889,Low product spender,17.975,Low order spender,19.0,Regular customer
4,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Slowest days,Most orders,8,New customer,7.988889,Low product spender,17.975,Low order spender,19.0,Regular customer

In [238]:
# Check missing values
df_ords_prods_cust_merged.isnull().sum()

user_id                                0
first_name                             0
last_name                              0
gender                                 0
state                                  0
age                                    0
date_joined                            0
num_dependents                         0
family_status                          0
annual_income                          0
years_as_customer                      0
order_id                               0
order_number                           0
orders_day_of_week                     0
order_hour_of_day                      0
days_since_prior_order           2076096
first_order_flag                       0
product_id                             0
add_to_cart_order                      0
reordered                              0
product_name                           0
aisle_id                               0
department_id                          0
prices                                 0
_merge                                 0
price_range_loc                        0
busiest_days                           0
busiest_period_of_day                  0
max_order                              0
loyalty_flag                           0
avg_product_price                      0
product_spending_flag                  0
avg_order_spending                     0
order_spending_flag                    0
median_days_since_prior_order          5
order_freq_flag                        5
dtype: int64

In [242]:
# Print rows with missing values from order_spending_flag and median_days_since_prior_order
missing_rows = df_ords_prods_cust_merged.loc[df_ords_prods_cust_merged['median_days_since_prior_order'].isna() | df_ords_prods_cust_merged['order_freq_flag'].isna()]

# Print the filtered rows
print(missing_rows)

          user_id first_name last_name gender     state  age date_joined  \
18509448   159838      Jason      Nava   Male  Arkansas   63  2018-11-09
18509449   159838      Jason      Nava   Male  Arkansas   63  2018-11-09
18509450   159838      Jason      Nava   Male  Arkansas   63  2018-11-09
18509451   159838      Jason      Nava   Male  Arkansas   63  2018-11-09
18509452   159838      Jason      Nava   Male  Arkansas   63  2018-11-09

          num_dependents family_status  annual_income  ...  busiest_days  \
18509448               3       married         140994  ...  Busiest days
18509449               3       married         140994  ...  Busiest days
18509450               3       married         140994  ...  Busiest days
18509451               3       married         140994  ...  Busiest days
18509452               3       married         140994  ...  Busiest days

          busiest_period_of_day  max_order  loyalty_flag  avg_product_price  \
18509448         Average orders          1  New customer               7.42
18509449         Average orders          1  New customer               7.42
18509450         Average orders          1  New customer               7.42
18509451         Average orders          1  New customer               7.42
18509452         Average orders          1  New customer               7.42

          product_spending_flag  avg_order_spending  order_spending_flag  \
18509448    Low product spender                37.1    Low order spender
18509449    Low product spender                37.1    Low order spender
18509450    Low product spender                37.1    Low order spender
18509451    Low product spender                37.1    Low order spender
18509452    Low product spender                37.1    Low order spender

          median_days_since_prior_order  order_freq_flag
18509448                            NaN              NaN
18509449                            NaN              NaN
18509450                            NaN              NaN
18509451                            NaN              NaN
18509452                            NaN              NaN

[5 rows x 36 columns]

#### Missing values here as this customer has only made one order. Therefore, there was no median_days_since_prior_order and because of that an order_freq_flag was not assigned.

In [249]:
# Assign 'Non-frequent customer' to user_id 159838
df_ords_prods_cust_merged.loc[df_ords_prods_cust_merged['user_id'] == 159838, 'order_freq_flag'] = 'Non-frequent customer'

In [251]:
# Verify change
print(df_ords_prods_cust_merged[df_ords_prods_cust_merged['user_id'] == 159838][['user_id', 'order_freq_flag']])

          user_id        order_freq_flag
18509448   159838  Non-frequent customer
18509449   159838  Non-frequent customer
18509450   159838  Non-frequent customer
18509451   159838  Non-frequent customer
18509452   159838  Non-frequent customer

### Step 8: Export new dataframe

In [256]:
# Export as pkl file
df_ords_prods_cust_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merged.pkl'))